app/views/users/show.html.erb

SELECT "micro_posts".* FROM "micro_posts" WHERE "micro_posts"."user_id" = 1
---
<p>
    <%= pluralize(@user.micro_posts.length, "MicroPost") %>